In [1]:
import pandas as pd

In [2]:
import plotly.express as px

df = px.data.iris()
df.head()

   sepal_length  sepal_width  petal_length  petal_width species  species_id
0           5.1          3.5           1.4          0.2  setosa           1
1           4.9          3.0           1.4          0.2  setosa           1
2           4.7          3.2           1.3          0.2  setosa           1
3           4.6          3.1           1.5          0.2  setosa           1
4           5.0          3.6           1.4          0.2  setosa           1

In [7]:
# iloc -> position
display(df.iloc[1:4, 4:])

# loc -> labels
display(df.loc[:, ["sepal_width", "petal_length"]])

  species  species_id
1  setosa           1
2  setosa           1
3  setosa           1

     sepal_width  petal_length
0            3.5           1.4
1            3.0           1.4
2            3.2           1.3
3            3.1           1.5
4            3.6           1.4
..           ...           ...
145          3.0           5.2
146          2.5           5.0
147          3.0           5.2
148          3.4           5.4
149          3.0           5.1

[150 rows x 2 columns]

In [13]:
(df['petal_width'] * 10) / np.pi

0      0.636620
1      0.636620
2      0.636620
3      0.636620
4      0.636620
         ...
145    7.321127
146    6.047888
147    6.366198
148    7.321127
149    5.729578
Name: petal_width, Length: 150, dtype: float64

In [15]:
import numpy as np

def width_transform(width):
    if width > 1:
        return (width * 10) / np.pi 
    else:
        return (width * 5) / np.e

df['petal_width'].apply(width_transform)

0      0.367879
1      0.367879
2      0.367879
3      0.367879
4      0.367879
         ...
145    7.321127
146    6.047888
147    6.366198
148    7.321127
149    5.729578
Name: petal_width, Length: 150, dtype: float64

In [18]:
# mask -> boolean series used to select data
mask = df['petal_length'] > 3
df[mask]

,sepal_length,sepal_width,petal_length,petal_width,species,species_id
50,7.0,3.2,4.7,1.4,versicolor,2
51,6.4,3.2,4.5,1.5,versicolor,2
52,6.9,3.1,4.9,1.5,versicolor,2
53,5.5,2.3,4.0,1.3,versicolor,2
54,6.5,2.8,4.6,1.5,versicolor,2
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,3
146,6.3,2.5,5.0,1.9,virginica,3
147,6.5,3.0,5.2,2.0,virginica,3
148,6.2,3.4,5.4,2.3,virginica,3
149,5.9,3.0,5.1,1.8,virginica,3

In [20]:
df.groupby('species')['sepal_width'].mean()

species
setosa        3.418
versicolor    2.770
virginica     2.974
Name: sepal_width, dtype: float64

### dates and strings

In [48]:
df = pd.read_csv("datetime_df.csv")
df.head()

                    dt      values
0  2022-01-01 00:00:00  100.867870
1  2022-01-01 01:00:00  100.950371
2  2022-01-01 02:00:00  100.015876
3  2022-01-01 03:00:00   97.719805
4  2022-01-01 04:00:00   98.952580

In [25]:
# datetime conversion

df['dt'] = pd.to_datetime(df['dt'], format="%Y-%m-%d %H:%M:%S")
df

                      dt      values
0    2022-01-01 00:00:00  100.867870
1    2022-01-01 01:00:00  100.950371
2    2022-01-01 02:00:00  100.015876
3    2022-01-01 03:00:00   97.719805
4    2022-01-01 04:00:00   98.952580
...                  ...         ...
8732 2022-12-30 20:00:00  187.479552
8733 2022-12-30 21:00:00  187.345827
8734 2022-12-30 22:00:00  188.294599
8735 2022-12-30 23:00:00  186.598889
8736 2022-12-31 00:00:00  184.968854

[8737 rows x 2 columns]

In [37]:
df['is_weekend'] = df['dt'].dt.day_of_week > 5
df

                      dt      values  is_weekend
0    2022-01-01 00:00:00  100.867870       False
1    2022-01-01 01:00:00  100.950371       False
2    2022-01-01 02:00:00  100.015876       False
3    2022-01-01 03:00:00   97.719805       False
4    2022-01-01 04:00:00   98.952580       False
...                  ...         ...         ...
8732 2022-12-30 20:00:00  187.479552       False
8733 2022-12-30 21:00:00  187.345827       False
8734 2022-12-30 22:00:00  188.294599       False
8735 2022-12-30 23:00:00  186.598889       False
8736 2022-12-31 00:00:00  184.968854       False

[8737 rows x 3 columns]

# TITLE

## subtitle

### header

#### bla bla

In [40]:
df['dt'].dt.hour

0        0
1        1
2        2
3        3
4        4
        ..
8732    20
8733    21
8734    22
8735    23
8736     0
Name: dt, Length: 8737, dtype: int32

- timestamp -> moment in time
- timedelta -> length of time
- date range -> interval of dates

In [50]:
df = pd.read_csv("string_df.csv")
df.head()

                                         description
0  Scents of smoke and aged honey entice on the n...
1  This bottling, which is Randall Grahm's hommag...
2  For an easy and aromatic Sauvignon, Ermacora d...
3  A 65-35 blend of Sangiovese and Cabernet Sauvi...
4  Like all of Beringer's 2001 gold letter single...

In [54]:
df['description'].str.contains("hello")

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Name: description, Length: 100, dtype: bool

In [55]:
df

                                          description
0   Scents of smoke and aged honey entice on the n...
1   This bottling, which is Randall Grahm's hommag...
2   For an easy and aromatic Sauvignon, Ermacora d...
3   A 65-35 blend of Sangiovese and Cabernet Sauvi...
4   Like all of Beringer's 2001 gold letter single...
..                                                ...
95  A very nice wine, lush and drinkable, that dem...
96  Leather, smashed berries and juniper reveal th...
97  A simple wine that straddles the balance betwe...
98  One of Australia's most expensive and sought-a...
99  Thick and luscious with deep oak tones and big...

[100 rows x 1 columns]

In [58]:
df['description'].str.replace(" ", "_").str.lower()

0     scents_of_smoke_and_aged_honey_entice_on_the_n...
1     this_bottling,_which_is_randall_grahm's_hommag...
2     for_an_easy_and_aromatic_sauvignon,_ermacora_d...
3     a_65-35_blend_of_sangiovese_and_cabernet_sauvi...
4     like_all_of_beringer's_2001_gold_letter_single...
                            ...
95    a_very_nice_wine,_lush_and_drinkable,_that_dem...
96    leather,_smashed_berries_and_juniper_reveal_th...
97    a_simple_wine_that_straddles_the_balance_betwe...
98    one_of_australia's_most_expensive_and_sought-a...
99    thick_and_luscious_with_deep_oak_tones_and_big...
Name: description, Length: 100, dtype: object

In [64]:
df['description'].str.len() / df['description'].str.split().str.len()

0     5.685714
1     6.214286
2     5.868421
3     6.343750
4     5.984375
        ...
95    6.200000
96    6.419355
97    6.046512
98    6.755556
99    5.651163
Name: description, Length: 100, dtype: float64